Repository: Pebber07/CalmWaves
Catalog: lib/l10n/app_*.arb
Languages: hu

source: Sign In
hu: Bejelentkezés

source: Register
hu: Regisztráció

source: Password
hu: Jelszó

source: Contact us
hu: Elérhetőség

source: Continue with Google
hu: Folytatás Google fiókkal

source: or
hu: vagy

source: Username
hu: Felhasználónév

source: Enter your username
hu: Add meg a felhazsnálóneved

source: Enter your password
hu: Add meg a jelszavad

source: Log In
hu: Bejelentkezés

source: Don't have an account?
hu: Még nem regisztráltál?

source: Sign Up
hu: Regisztráció

source: Articles
hu: Cikkek

source: Hot
hu: Felkapott

source: Favorites
hu: Kedvencek

source: Create event
hu: Esemény létrehozása

source: Enter Theme
hu: Téma megadása

source: Forum
hu: Fórum

source: Search
hu: Keresés

source: New Entry
hu: Új Bejegyzés

source: How are you today?
hu: Hogy megy a napod?

source: Angry
hu: Mérges

source: Sad
hu: SZomorú

source: It's going
hu: Megyeget

source: Happy
hu: Boldog

source: Excited
hu: Izgatott

# ultraHappy
source: Incredible
hu: Varázslatos

source: Mood History
hu: Hangulat Napló

source: Password Again
hu: Jelszó újra

source: New PAssword Again
hu: Új jelszó újra

# refreshPassword
source: Save new password
hu: Új jelszó elmentése

source: Theme
hu: Téma

source: App Language
hu: Alkalmazás nyelve

source: Actions
hu: Műveletek

# userProfileSettings
source: Profile Settings
hu: Profil Beállítások

source: New Username
hu: Új Felhasználónév

source: Save new username
hu: Új felhasználónév elmentése

source: Modify Password
hu: Jelszó Módosítása

source: Old Password
hu: Régi jelszó

source: New Password
hu: Új jelszó

# securelyManage
source: Securely manage your mental health journey and get personalized advice in one place.
hu: Menedzseld és szerezz személyre szabott véleményeket a mentális higiénédről.

source: Get Started
hu: Kezdjünk bele

source: Already a member?
hu: Már van fiókom

source: Url Error
hu: Hiba a letöltési URL lekérésekor

source: User offline
hu: Nincs bejelentkezve a felhasználó

source: No articles available
hu: Nincsenek elérhető cikkek

source: Event successfully created
hu: Az esemény sikeresen létrejött

source: error
hu: Hiba

# setThemeAndLeaveNotes
source: Set themes, and leave notes
hu: Témák, és megjegyzések beállítása

source: note
hu: Megjegyzés

source: Save date
hu: Dátum mentése

source: Modify comment
hu: Hozzászólás szerkesztése

source: Comment
hu: Hozzászólás

source: Cancel
hu: Mégse

source: Save
hu: Mentés

source: Delete comment
hu: Komment törlése

# deleteCommentSure
source: Are you sure deleting this comment?
hu: Biztosan törölni szeretnéd ezt a hozzászólást?

source: Delete
hu: Törlés

source: Posts
hu: Bejegyzések

source: Comments
hu: Hozzászólások

# noComments
source: No comments available
hu: Nincsenek kommentek

source: Modify
hu: Szerkesztés

source: New post
hu: Új hozzászólás

source: No data found
hu: Nincs találat

source: Create Journal
hu: Napló létrehozása

source: Title
hu: Cím

source: Content
hu: Tartalom

# signInToSeeYourJournal
source: Login to access your Journal
hu: Be kell jelentkezni a napló megtekintéséhez

# errorDuringLoad
source: Error during data load
hu: Hiba történt az adatok betöltése közben

# noJournalEntrys
source: No Journal Entrys available
hu: Nincsenek napló bejegyzések

# noTitle
source: Empty title
hu: Nincs cím

# noContent
source: Empty content
hu: Nincs tartalom

# noDate
source: Empty date
hu: Nincs dátum

source: No internet connection
hu: Nincs internetkapcsolat

source: Connect Network
hu: Csatlakozz a hálózathoz

source: Fill all the fields
hu: Kérem, az összes mezőt töltse ki

# emailNotVerified
source: Confirm email
hu: Erősítsd meg az emailed

source: Unknown error
hu: Ismeretlen hiba történt

source: Network error
hu: Hálózati hiba

# emailEmpty
source: Missing email
hu: Hiányzó email

source: Enter your email
hu: Kérlek, add meg az email címed

source: Email sent
hu: Email elküldve

# getBackPassword
source: We have sent a password reset link to your email address.
hu: Jelszó visszaállító linket küldtünk az email címedre

# forgotYourPassword
source: Forgot you password?
hu: Elfelejtetted a jelszavad?

source: Continue as a guest
hu: Folytatás vendégként

source: Delete user
hu: Felhasználó törlése

# sureDelete
source: Are you sure you want to delete the user and all their data?
hu: Biztosan törlöd a felhasználót, és ezzel minden adatát?

# userAndDataDeleted
source: User and their data have been deleted
hu: Felhasználó és adatai törölve lettek

# userHandle
source: Manage Users
hu: Felhasználk kezelése

source: Role
hu: Szerep

source: No mood history found
hu: Nincsenek hangulat bejegyzések

source: Mood trends
hu: Hangulat Görbe

# deleteProfile
source: Delete user profile
hu: Profil zárolása

# sureDeleteProfile
source: Are you sure you want to delete your account?
hu: Biztosan törölni szeretnéd a fiókodat?

# reauthenticate
source: Reauthentication
hu: Újrahitelesítés

# givePasswordToDelete
source: Enter your password to confirm deletion.
hu: Add meg a jelszavad a törlés megerősítéséhez

# errorOccuredDuringProfileDelete
source: An error occurred while locking the account.
hu: Hiba történt a fiók zárolása közben

# guestLoggedIn
source: You logged in as a Guest
hu: Vendég fiókkal vagy bejelentkezve

# registerToAccessEveryFunc
source: Register to access all features
hu: Regisztrálj, hogy elérd az összes funkciót

source: Admin functions
hu: Admin funkciók

# handleUsers
source: Manage Users
hu: Felhasználók kezelése

source: Log out
hu: Kijelenetkezés

# usedUserName
source: This username is taken.
hu: Ez a felhazsnálónév foglalt

# guestNotChoose
source: Usernames starting with Guest# are not accepted.
hu: A Guest# kezdetű felhazsnálónevek nem válaszhatók

# successfullRegister
source: Registration Successfull
hu: Sikeres Regisztráció

# confirmEmail
source: Confirm your email address to finalize your registration.
hu: Erősítsd meg az email címedet a regisztráció véglegesítéséhez

source: Enter
hu: Belépes

# noAccountChosen
source: You have not selected an account
hu: Nem választott fiókot

# passwordsNotMatching
source: The passwords provided are different.
hu: A megadott jelszavak különbözőek

source: Weak password
hu: Gyenge jeleszó

# usernameAlreadyUsed
source: Username is taken.
hu: A felhazsnálónév foglalt

source: Username updated
hu: Felhasználónév frissítve

source: Password updated
hu: Jelszó frissítve

# errorDuringPassword
source: Error changing password
hu: Hiba a jelszó módosításakor

# errorEmailOpen
source: Unable to open email client
hu: Nem sikerült megnyitni az email klienst

# usernameAlreadyUpdated
source: Username already changed
hu: A felhazsnálónév már módosítva

# currentPasword
source: Currwnt password
hu: Jelenlegi jelszó

source: Dark mode
hu: Sötét mód

source: Notifications
hu: Értesítések

source: Welcome
hu: Köszöntelek

# introduce
source: Introduce yourself to
hu: Mutasd be magad

source: Managing stress
hu: Stresszekezlés

source: Tracking Progress
hu: Mentális fejlődés

source: Receive Support
hu: Segítség nyújtás

source: Relax
hu: Relaxálj

# monitorMentalHealth
source: Monitor your mental Health
hu: Tartsd kézben a mentálihigiénéd

# connectOurcaring
source: Experience the caring
hu: Tapasztald meg a törődésünk

# googleError
source: Error while signing in with Google
hu: Hiba a Google-s bejelentkezés során

# addOwnArticle
source: Create own article
hu: Saját cikk létrehozása

source: Article title
hu: Cikk címe

source: Article excerpt
hu: Cikk rövid leírás

source: Excerpt
hu: Rövid leírás

# writeArticleContent
source: Start writing the content of your article
hu: Kezdd el írni a cikked tartalmát

source: Choose a picture
hu: Válassz egy képet

source: Choose a video
hu: Váalssz egy videót

source: Post article
hu: Bejegyzés posztolása

source: Marked
hu: Kijeleölt

# chooseATime
source: Choose a date
hu: Válassz egy időpontot

# choosedTime
source: Selected date
hu: Kiválasztott időpont

# itsTime
source: It's time to calm down!
hu: Nyugalom

# downloadProfilePictureError
source: An error occurred while downloading your profile picture.
hu: Hiba történt a profilkép letöltésekor

# pleaseLoginMood
source: Please log in to save your mood post.
hu: Kérlek, jelentkezz be a hangulat bejegyzésed elmentéséhez

source: Mood saved
hu: Hangulat bejegyzés mentve

# errorDuringMoodSave
source: Error saving mood post
hu: Hiba hangulat bejegyzés mentése közben

# postModify
source: Modify post
hu: Bejegyzés szerkesztése

# deleteSure
source: Confirm deletion
hu: Törlés megerősítése

# deleteSurePostAndComments
source: Are you sure you want to delete this post and its associated comments?
hu: Biztosan törlöd a bejegyzést, és a hozzá tartozó bejegzéseket?

# journalDeleteDefinitively
source: The journal entry is permanently deleted.
hu: A napló bejegyzés véglegesen törlődik

# noMoodData
source: No mood entry found
hu: Nincsen még hangulat bejegyzésed

source: Days
hu: Napok

# fillBothFields
source: Fill in both fields.
hu: Töltsd ki mindkét mezőt

source: Offline user
hu: Offline felhasználó

# errorHappened
source: Error occured
hu: Hiba történt

source: New forum post
hu: Új fórum bejegyzés

source: Create
hu: Létrehozás

# noPictureChoosed
source: No image selected
hu: Nincs kiválasztott kép

# profilePicSuccessfullyUploaded
source: Profile picture successfully uploaded
hu: Profilkép sikeresen feltöltve

# errorDuringUpload
source: An error occurred while uploading the image.
hu: Hiba történt a kép feltöltésekor

# monday
source: M
hu: H

# tuesday
source: Tu
hu: K

# wednesday
source: W
hu: SZe

# thursday
source: Th
hu: CS

# friday
source: F
hu: P

# saturday
source: Sa
hu: SZo

# sunday
source: Su
hu: V

# weekyActivity
source: Weekly activity
hu: Heti aktivitás

source: Connection lost
hu: Internetkapcsolat megszakadt

# connectionBack
source: Internet connection restored
hu: Internetkapcsolat helyreállt

source: Unknown
hu: Ismeretlen

# noWaitingArticles
source: You don't have waiting articles
hu: Nincsen várakozó cikked

source: No excerpt
hu: Nincs rövid leírás

# selectedTime
source: Selected date
hu: Kiválasztott időpont

source: Next
hu: Következő
